reliablemessage/reliablemessage-connector/reliablemessage-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/soapRequests/greetMeRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
                   xmlns:xs="http://www.w3.org/2001/XMLSchema"
                   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <SOAP-ENV:Body>
        <ns4:greetMe xmlns:ns4="http://cxf.apache.org/hello_world_soap_http/types">
            <ns4:requestType>Gil</ns4:requestType>
        </ns4:greetMe>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>